InformationRegisters/СведенияОСтавкахОСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахОСМС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаВзносы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаОтчисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахОСМС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьСведенияОСтавкахОСМС();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахОСМС() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахОСМС.СоздатьНаборЗаписей();
	
	// ДоходыОтРаботодателя
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20170701', Перечисления.ЮрФизЛицо.ФизЛицо, 	0, 1);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20180101', Перечисления.ЮрФизЛицо.ФизЛицо, 	0, 1.5);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20200101', Перечисления.ЮрФизЛицо.ФизЛицо, 	1, 2);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20210101', Перечисления.ЮрФизЛицо.ФизЛицо, 	2, 2);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20220101', Перечисления.ЮрФизЛицо.ФизЛицо, 	2, 3);
    
    // ДоходыОтНалоговогоАгента
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20170701', Перечисления.ЮрФизЛицо.ЮрЛицо, 5, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20180101', Перечисления.ЮрФизЛицо.ЮрЛицо, 0, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20200101', Перечисления.ЮрФизЛицо.ЮрЛицо, 1, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20210101', Перечисления.ЮрФизЛицо.ЮрЛицо, 2, 0);
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, Период, ВидДохода,СтавкаВзносы,СтавкаОтчисления)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.СтавкаВзносы = СтавкаВзносы;
	НоваяЗапись.СтавкаОтчисления = СтавкаОтчисления;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
